$(document).ready(() => {
	const MAX_ITEMS_COUNT = 5; // максимально количество отображаемых пунктов в меню
	window.currentMenu = null;
	const ITEM_HEIGHT = 4;
	var test = [255];
	for (var i = 1; i < 100; i++) test.push(i + "");

	function onEnterBizHandler(menuName, values) {
		if (!values) return;
		var isOwner = values.isOwner || false;
		var owner = values.owner || 0;
		var items = menus[menuName].items;
		if (items[items.length - 1].text == "Панель управления") items.splice(items.length - 1, 1);
		if (items[items.length - 1].text == "Купить бизнес") items.splice(items.length - 1, 1);
		if (isOwner) {
			items.push({
				text: "Панель управления"
			});
		} else {
			if (!owner) items.push({
				text: "Купить бизнес"
			});
		}

		infoTableAPI.hide();
	}

	var menuItems = {

	};

	var menus = {
		"character_main": {
			header: "Персонаж",
			location: "left-middle-upper",
			items: [
				{
					text: "Имя",
					placeholder: "Имя",
					type: "text-field"
				},
				{
					text: "Фамилия",
					placeholder: "Фамилия",
					type: "text-field"
				},
				{
					text: "Пол",
					values: ["Мужской", "Женский"]
				},
				{
					text: "Наследственность"
				},
				{
					text: "Характеристики"
				},
				{
					text: "Внешний вид"
				},
				{
					text: "Одежда"
				},
				{
					text: "Далее"
				}
			],
			prompt: "Создайте персонажа.",
			logo: false,
			maxItemsCount: 6,
		},
		"character_change": {
			header: "Персонаж",
			location: "left-middle-upper",
			items: [
				{
					text: "Наследственность"
				},
				{
					text: "Пол"
				},
				{
					text: "Характеристики"
				},
				{
					text: "Внешний вид"
				},
				{
					text: "Изменить"
				}
			],
			prompt: "Изменение внешности.",
			logo: false,
			maxItemsCount: 6,
		},
		"character_parents": {
			header: "Наследственность",
			location: "left-middle-upper",
			items: [{
					text: "Мама",
					values: [ "Ханна", "Одри", "Жасмин", "Жизель", "Амелия",
						"Изабелла", "Зои", "Эва", "Камилла", "Виолетта", "София",
						"Эвелин", "Николь", "Эшли", "Грейс", "Брианна", "Натали",
						"Оливия", "Элизабет", "Шарлотта", "Эмма", "Мисти"
					]
				},
				{
					text: "Папа",
					values: [ "Бенджамин", "Дэниел", "Джошуа", "Ноа", "Эндрю",
						"Хуан", "Алекс", "Исаак", "Эван", "Итан", "Винсент", "Анхель",
						"Диего", "Эдриан", "Габриэль", "Майкл", "Сантьяго", "Кевин",
						"Луис", "Самуил", "Энтони", "Клод", "Джон", "Нико"
					]
				},
				{
					text: "Сходство",
					// values: ["100% с мамой", "75% с мамой", "50%", "75% с папой", "100% с папой"],
					values: [ "0%", "2%", "4%", "6%", "8%", "10%", "12%", "14%", "16%", "18%", "20%", "22%", "24%",
						"26%", "28%", "30%", "32%", "34%", "36%", "38%", "40%", "42%", "44%", "46%", "48%", "50%", "52%",
						"54%", "56%", "58%", "60%", "62%", "64%", "66%", "68%", "70%", "72%", "74%", "76%", "78%", "80%",
						"82%", "84%", "86%", "88%", "90%", "92%", "94%", "96%", "98%", "100%" ]
					,
					valueIndex: 25
				},
				{
					text: "Цвет кожи",
					/* values: ['#c59a7c', '#e7cbaf', '#ffd7a6', '#f2dbcd', '#906a5f'],
					type: "choice-color" */
					values: [ "0%", "2%", "4%", "6%", "8%", "10%", "12%", "14%", "16%", "18%", "20%", "22%", "24%",
						"26%", "28%", "30%", "32%", "34%", "36%", "38%", "40%", "42%", "44%", "46%", "48%", "50%", "52%",
						"54%", "56%", "58%", "60%", "62%", "64%", "66%", "68%", "70%", "72%", "74%", "76%", "78%", "80%",
						"82%", "84%", "86%", "88%", "90%", "92%", "94%", "96%", "98%", "100%" ]
					,
					valueIndex: 25
				},
				/* {
					text: "Характер",
					values: ['Триатлонист', 'Бодибилдер', 'Снайпер', 'Ниндзя', 'Ас', 'Гонщик', 'Нормальный']
				}, */
				{
					text: "Вернуться"
				}
			],
			prompt: "Выберите наследственность.",
			on: () => {
				$(`.selectMenu .family-preview`).show();
			},
			logo: false,
		},
		"character_faceFeatures": {
			header: "Характеристики",
			location: "left-middle-upper",
			prompt: "Измените внешность.",
			logo: false,
			maxItemsCount: 10,
			items: [
				// valueIndex
				{ text: "Ширина носа", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Положение носа", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Длина носа", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Переносица", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Кончик носа", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Сдвиг переносицы", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Высота лба", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Форма лба", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Положение скул", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Форма скул", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Щеки", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Глаза", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Губы", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Ширина челюсти", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Форма челюсти", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Длина подбородка", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Положение подбородка", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Ширина подбородка", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Форма подбородка", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Шея", values: [ "0%", "1%", "2%", "3%", "4%", "5%", "6%", "7%", "8%", "9%", "10%", "11%", "12%", "13%", "14%", "15%", "16%", "17%", "18%", "19%", "20%", "21%", "22%", "23%", "24%", "25%", "26%", "27%", "28%", "29%", "30%", "31%", "32%", "33%", "34%", "35%", "36%", "37%", "38%", "39%", "40%", "41%", "42%", "43%", "44%", "45%", "46%", "47%", "48%", "49%", "50%", "51%", "52%", "53%", "54%", "55%", "56%", "57%", "58%", "59%", "60%", "61%", "62%", "63%", "64%", "65%", "66%", "67%", "68%", "69%", "70%", "71%", "72%", "73%", "74%", "75%", "76%", "77%", "78%", "79%", "80%", "81%", "82%", "83%", "84%", "85%", "86%", "87%", "88%", "89%", "90%", "91%", "92%", "93%", "94%", "95%", "96%", "97%", "98%", "99%", "100%" ], valueIndex: 50 },
				{ text: "Вернуться" }
			]
		},
		"character_look": {
			header: "Внешний вид",
			location: "left-middle-upper",
			items: [],
			prompt: "Измените внешний вид.",
			logo: false,
			maxItemsCount: 10,
		},
		"character_clothes": {
			header: "Одежда",
			location: "left-middle-upper",
			items: [],
			prompt: "Выберите одежду.",
			logo: false,
		},
		"!enter_house": {
			header: "Дом",
			location: "left-top",
			items: [{
					text: "Войти в дом"
				},
				{
					text: "Позвонить в звонок"
				},
				{
					text: "Информация о доме"
				},
				{
					text: "Закрыть"
				},
			],
			on: () => {
				infoTableAPI.hide();
			},
		},
		"!exit_house": {
			header: "Дверь",
			location: "left-top",
			items: [{
					text: "Выйти на улицу"
				},
				{
					text: "Закрыть"
				},
			],
			on: () => {
				infoTableAPI.hide();
			},
		},
		"actions_anims": {
			header: "Меню",
			location: "right-middle",
			items: [{
					text: "Жесты"
				},
				{
					text: "Танцы 1"
				},
				{
					text: "Танцы 2"
				},
				{
					text: "Действия"
				},
				{
					text: "Спорт"
				},
				{
					text: "Положение"
				},
				{
					text: "Сидеть"
				},
				{
					text: "Стоять"
				},
				{
					text: "Соитие"
				},
			]
		},
		"anim_gesture": {
			header: "Меню",
			location: "right-middle",
			items: [{
					text: "Воздушная гитара"
				},
				{
					text: "Изображать секс"
				},
				{
					text: "Невидимое пианино"
				},
				{
					text: "Воздушный поцелуй"
				},
				{
					text: "Выразить уважение"
				},
				{
					text: "Изображать цыпленка"
				},
				{
					text: "Изобразить DJ'я"
				},
				{
					text: "Фейс палм"
				},
				{
					text: "Показать всем фак"
				},
				{
					text: "Беллиссимо"
				},
				{
					text: "Сюрприз"
				},
				{
					text: "Разминать кулаки"
				},
				{
					text: "Нет нет нет!"
				},
				{
					text: "Ковыряться в носу"
				},
				{
					text: "Всем peace!"
				},
				{
					text: "Сорить деньгами!"
				},
				{
					text: "Медленно аплодировать"
				},
				{
					text: "Кривляться"
				},
				{
					text: "Лайк"
				},
				{
					text: "Дайте 2"
				},
				{
					text: "Крутить пальцем у виска"
				},
			]
		},
		"anim_dance1": {
			header: "Меню",
			location: "right-middle",
			items: [{
					text: "Танец 1"
				},
				{
					text: "Танец 2"
				},
				{
					text: "Танец 3"
				},
				{
					text: "Танец 4"
				},
				{
					text: "Танец 5"
				},
				{
					text: "Танец 6"
				},
				{
					text: "Танец 7"
				},
				{
					text: "Танец 8"
				},
				{
					text: "Танец 9"
				},
				{
					text: "Танец 10"
				},
				{
					text: "Танец 11"
				},
				{
					text: "Танец 12"
				},
				{
					text: "Танец 13"
				},
				{
					text: "Танец 14"
				},
				{
					text: "Танец 15"
				},
				{
					text: "Танец 16"
				},
				{
					text: "Танец 17"
				},
				{
					text: "Танец 18"
				},
				{
					text: "Танец 19"
				},
				{
					text: "Танец 20"
				},
				{
					text: "Танец 21"
				},
				{
					text: "Танец 22"
				},
				{
					text: "Танец 23"
				},
				{
					text: "Танец 24"
				},
				{
					text: "Танец 25"
				},
				{
					text: "Танец 26"
				},
				{
					text: "Танец 27"
				},
				{
					text: "Танец 28"
				},
				{
					text: "Танец 29"
				},
				{
					text: "Танец 30"
				},
				{
					text: "Танец 31"
				},
				{
					text: "Танец 32"
				},
				{
					text: "Танец 33"
				},
				{
					text: "Танец 34"
				},
				{
					text: "Танец 35"
				},
			]
		},
		"anim_dance2": {
			header: "Меню",
			location: "right-middle",
			items: [{
					text: "Танец 1"
				},
				{
					text: "Танец 2"
				},
				{
					text: "Танец 3"
				},
				{
					text: "Танец 4"
				},
				{
					text: "Танец 5"
				},
				{
					text: "Танец 6"
				},
				{
					text: "Танец 7"
				},
				{
					text: "Танец 8"
				},
				{
					text: "Танец 9"
				},
				{
					text: "Танец 10"
				},
				{
					text: "Танец 11"
				},
				{
					text: "Танец 12"
				},
				{
					text: "Танец 13"
				},
				{
					text: "Танец 14"
				},
				{
					text: "Танец 15"
				},
				{
					text: "Танец 16"
				},
				{
					text: "Танец 17"
				},
				{
					text: "Танец 18"
				},
				{
					text: "Танец 19"
				},
				{
					text: "Танец 20"
				},
				{
					text: "Танец 21"
				},
				{
					text: "Танец 22"
				},
				{
					text: "Танец 23"
				},
				{
					text: "Танец 24"
				},
				{
					text: "Танец 25"
				},
				{
					text: "Танец 26"
				},
				{
					text: "Танец 27"
				},
				{
					text: "Танец 28"
				},
				{
					text: "Танец 29"
				},
				{
					text: "Танец 30"
				},
				{
					text: "Танец 31"
				},
				{
					text: "Танец 32"
				},
				{
					text: "Танец 33"
				},
				{
					text: "Танец 34"
				},
				{
					text: "Танец 35"
				},
			]
		},
		"anim_actions": {
			header: "Меню",
			location: "right-middle",
			items: [{
					text: "Блевать сидя"
				},
				{
					text: "Стучать в дверь"
				},
				{
					text: "Охеревать"
				},
				{
					text: "Стряхнуть пыль с одежды"
				},
				{
					text: "Разговаривать по телефону"
				},
				{
					text: "В раздумиях"
				},
				{
					text: "Попросить успокоится"
				},
				{
					text: "Поднять руки"
				},
				{
					text: "Нервничать"
				},
				{
					text: "Руки за головой"
				},
				{
					text: "Гневаться на небеса"
				},
				{
					text: "Отлить"
				},
				{
					text: "На старт"
				},
				{
					text: "Махать руками"
				},
				{
					text: "Лежать связанным"
				},
				{
					text: "Молиться"
				},
				{
					text: "Попросить пройти"
				},
				{
					text: "Поднять руки"
				},
				{
					text: "Прикрыть голову 1"
				},
				{
					text: "Прикрыть голову 2"
				},
				{
					text: "Прикрыть голову 3"
				},
				{
					text: "Складывать в сумку"
				}
			]
		},
		"anim_sport": {
			header: "Меню",
			location: "right-middle",
			items: [{
					text: "Разминка 1"
				},
				{
					text: "Разминка 2"
				},
				{
					text: "Разминка 3"
				},
				{
					text: "Разминка 4"
				},
				{
					text: "Разминка 5"
				},
				{
					text: "Разтяжка"
				},
				{
					text: "Йога 1"
				},
				{
					text: "Йога 2"
				},
				{
					text: "Йога 3"
				},
			]
		},
		"anim_lay": {
			header: "Меню",
			location: "right-middle",
			items: [{
					text: "Лежать 1"
				},
				{
					text: "Лежать 2"
				},
				{
					text: "Лежать 3"
				}
			]
		},
		"anim_sit": {
			header: "Меню",
			location: "right-middle",
			items: [{
					text: "Сидеть 1"
				},
				{
					text: "Сидеть 2"
				},
				{
					text: "Сидеть 3"
				},
				{
					text: "Сидеть 4"
				},
				{
					text: "Сидеть 5"
				},
				{
					text: "Сидеть 6"
				}
			]
		},
		"anim_stand": {
			header: "Меню",
			location: "right-middle",
			items: [{
					text: "Ожидать 1"
				},
				{
					text: "Ожидать 2"
				},
				{
					text: "Ожидать 3"
				},
				{
					text: "Оперется 1"
				},
				{
					text: "Оперется 2"
				},
				{
					text: "Уставший"
				},
				{
					text: "Сосредоточенный"
				}
			]
		},
		"anim_sex": {
			header: "Меню",
			location: "right-middle",
			items: [{
					text: "Мужчина 1"
				},
				{
					text: "Мужчина 2"
				},
				{
					text: "Мужчина 3"
				},
				{
					text: "Женщина 1"
				},
				{
					text: "Женщина 2"
				},
				{
					text: "Женщина 3"
				},
				{
					text: "Женщина 4"
				}
			]
		},
		"actions_list": {
			header: "Меню",
			location: "right-middle",
			items: [{
					text: "Анимации"
				},
				{
					text: "Сценарии"
				},
				{
					text: "Отмена"
				},
				{
					text: "Закрыть"
				},
			]
		},
		"actions_scenarios": {
			header: "Типы",
			location: "right-middle",
			items: [{
					text: "Сидеть"
				},
				{
					text: "Стоять"
				},
				{
					text: "Положение"
				},
				{
					text: "Спорт"
				},
				{
					text: "Работа"
				},
				{
					text: "Социальные"
				},
			]
		},
		"social": {
			header: "Меню",
			location: "right-middle",
			items: [{
					text: "Пить кофе"
				},
				{
					text: "Курить сигарету"
				},
				{
					text: "Смотреть в бинокль"
				},
				{
					text: "Умываться"
				},
				{
					text: "Просить милостыню"
				},
				{
					text: "Ожидать"
				},
				{
					text: "Умываться"
				},
				{
					text: "Аплодировать"
				},
				{
					text: "Курить косяк"
				},
				{
					text: "Снимать на телефон"
				},
				{
					text: "Греться у костра"
				},
				{
					text: "Ждать"
				},
				{
					text: "Тусоваться"
				},
				{
					text: "Писать СМС"
				},
				{
					text: "Смотреть стриптиз"
				},
				{
					text: "Смотреть карту"
				},
				{
					text: "Делать селфи"
				},
				{
					text: "Копаться в мусорке"
				},
				{
					text: "Считать мелочь"
				},
				{
					text: "Ждать попутку"
				},
				{
					text: "Пить пиво"
				},
			]
		},
		"works": {
			header: "Меню",
			location: "right-middle",
			items: [{
					text: "Парковщик"
				},
				{
					text: "Строитель 1"
				},
				{
					text: "Строитель 2"
				},
				{
					text: "Садовник 1"
				},
				{
					text: "Садовник 2"
				},
				{
					text: "Детектив 1"
				},
				{
					text: "Детектив 2"
				},
				{
					text: "Детектив 3"
				},
				{
					text: "Охраник 1"
				},
				{
					text: "Охраник 2"
				},
				{
					text: "Охраник 3"
				},
				{
					text: "Уборщик 1"
				},
				{
					text: "Уборщик 2"
				},
				{
					text: "Музыкант"
				},
				{
					text: "Фотограф"
				},
				{
					text: "Проститутка 1"
				},
				{
					text: "Проститутка 2"
				},
				{
					text: "Рыбак"
				},
				{
					text: "Механик 1"
				},
				{
					text: "Механик 2"
				},
				{
					text: "Повар"
				},
				{
					text: "Сварщик"
				},
				{
					text: "Мим"
				},
			]
		},
		"sport": {
			header: "Меню",
			location: "right-middle",
			items: [{
					text: "Позировать"
				},
				{
					text: "Качать бицепс"
				},
				{
					text: "Отжиматься"
				},
				{
					text: "Качать пресс"
				},
				{
					text: "Подтягиваться"
				},
				{
					text: "Жим лежа"
				},
				{
					text: "Бег на месте"
				},
				
			]
		},
		"lay": {
			header: "Меню",
			location: "right-middle",
			items: [{
					text: "Лежать на боку"
				},
				{
					text: "Лежать на животе"
				},
				{
					text: "Лежать на спине"
				},
				
			]
		},
		"stand": {
			header: "Меню",
			location: "right-middle",
			items: [{
					text: "Руки на пояс"
				},
				{
					text: "Тусоваться"
				},
				{
					text: "Статуя"
				},
				{
					text: "Курить"
				},
				{
					text: "Греться у костра"
				},
				
			]
		},
		"sit": {
			header: "Меню",
			location: "right-middle",
			items: [{
					text: "Сидеть на земле"
				},
				{
					text: "Сидеть на уступе"
				},
				{
					text: "Сидеть на ступеньках"
				},
				{
					text: "Сидеть на стене"
				},
				{
					text: "Ступор"
				},
				{
					text: "Сидеть в кресле"
				},
				{
					text: "За барной стойкой"
				},
				{
					text: "Сидеть на скамье"
				},
				{
					text: "Сидеть на остановке"
				},
				{
					text: "Сидеть на стуле"
				},
				{
					text: "Сидеть за ПК"
				},
				{
					text: "Сидеть на шезлонге"
				},
				{
					text: "Сидеть на шезлонге 2"
				},
				{
					text: "Сидя смотреть стриптиз"
				}
				
			]
		},
		"enter_biz_1": {
			header: "Закусочная",
			location: "right-middle",
			items: [{
					text: "Пункт 1"
				},
				{
					text: "Пункт 2"
				},
				{
					text: "Пункт 3"
				},
			],
			on: (values) => {
				onEnterBizHandler("enter_biz_1", values);
			},
		},
		"enter_biz_2": {
			header: "Бар",
			location: "right-middle",
			items: [{
					text: "Пункт 1"
				},
				{
					text: "Пункт 2"
				},
				{
					text: "Пункт 3"
				},
			],
			on: (values) => {
				onEnterBizHandler("enter_biz_2", values);
			},
		},

		"enter_biz_3": {
			header: "Магазин одежды",
			logo: false,
			location: "right-middle",
			items: [{
				text: "Примерочная"
			}],
			on: (values) => {
				onEnterBizHandler("enter_biz_3", values);
			},
		},
		"biz_3_clothes": {
			header: "Примерочная",
			logo: false,
			location: "right-middle",
			items: [{
					text: "Верхняя одежда"
				},
				{
					text: "Нижняя одежда"
				},
				{
					text: "Обувь"
				},
				{
					text: "Головные уборы"
				},
				{
					text: "Очки"
				},
				{
					text: "Браслеты"
				},
				{
					text: "Серьги"
				},
				// {
				// 	text: "Маски"
				// },
				{
					text: "Аксессуары"
				},
				{
					text: "Часы"
				},
				{
					text: "Завершить"
				},
			]
		},
		"biz_3_top": {
			header: "Верхняя одежда",
			logo: false,
			location: "right-middle",
			items: [{
				text: "Заполняется скриптом...."
			}]
		},
		"biz_3_legs": {
			header: "Нижняя одежда",
			logo: false,
			location: "right-middle",
			items: [{
				text: "Заполняется скриптом...."
			}]
		},
		"biz_3_feets": {
			header: "Обувь",
			logo: false,
			location: "right-middle",
			items: [{
				text: "Заполняется скриптом...."
			}]
		},
		"biz_3_hats": {
			header: "Головные уборы",
			logo: false,
			location: "right-middle",
			items: [{
				text: "Заполняется скриптом...."
			}]
		},
		"biz_3_glasses": {
			header: "Очки",
			logo: false,
			location: "right-middle",
			items: [{
				text: "Заполняется скриптом...."
			}]
		},
		"biz_3_bracelets": {
			header: "Браслеты",
			logo: false,
			location: "right-middle",
			items: [{
				text: "Заполняется скриптом...."
			}]
		},
		"biz_3_ears": {
			header: "Серьги",
			logo: false,
			location: "right-middle",
			items: [{
				text: "Заполняется скриптом...."
			}]
		},
		"biz_3_masks": {
			header: "Маски",
			logo: false,
			location: "right-middle",
			items: [{
				text: "Заполняется скриптом...."
			}]
		},
		"biz_3_ties": {
			header: "Аксессуары",
			logo: false,
			location: "right-middle",
			items: [{
				text: "Заполняется скриптом...."
			}]
		},
		"biz_3_watches": {
			header: "Часы",
			logo: false,
			location: "right-middle",
			items: [{
				text: "Заполняется скриптом...."
			}]
		},
		"enter_biz_4": {
			header: "Барбершоп",
			location: "right-middle",
			items: [{
					text: "Пункт 1"
				},
				{
					text: "Пункт 2"
				},
				{
					text: "Пункт 3"
				},
			],
			on: (values) => {
				onEnterBizHandler("enter_biz_4", values);
			},
		},
		"enter_biz_5": {
			header: "АЗС",
			location: "right-middle",
			items: [{
				text: "Топливо",
			}, ],
			on: (values) => {
				onEnterBizHandler("enter_biz_5", values);
			},
		},
		"biz_5_items": {
			header: "Топливо",
			location: "right-middle",
			items: [{
					text: "Заправить",
					values: ["5 л.", "10 л.", "20 л.", "40 л.", "80 л."],
				},
				{
					text: "Пополнить канистру"
				},
				{
					text: "Вернуться"
				},
			],
		},
		"enter_biz_6": {
			header: "24/7",
			location: "right-middle",
			items: [{
				text: "Магазин"
			}, ],
			on: (values) => {
				onEnterBizHandler("enter_biz_6", values);
			},
		},
		"biz_6_items": {
			header: "Магазин",
			location: "right-middle",
			items: [{
					text: "eCola"
				},
				{
					text: "EgoChaser"
				},
				{
					text: "Meteorite"
				},
				{
					text: "P's & Q's"
				},
				{
					text: "Пачка Redwood"
				},
				{
					text: "Pisswasser"
				},
				{
					text: "Телефон"
				},
				{
					text: "Сумка"
				},
				{
					text: "Канистра"
				},
				{
					text: "Пластырь"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"enter_biz_7": {
			header: "Тату салон",
			location: "right-middle",
			items: [{
					text: "Пункт 1"
				},
				{
					text: "Пункт 2"
				},
				{
					text: "Пункт 3"
				},
			],
			on: (values) => {
				onEnterBizHandler("enter_biz_7", values);
			},
		},
		"enter_biz_8": {
			header: "Оружейный магазин",
			location: "right-middle",
			items: [{
					text: "Оружия"
				},
				{
					text: "Патроны"
				}
			],
			on: (values) => {
				onEnterBizHandler("enter_biz_8", values);
			},
		},
		"biz_8_guns": {
			header: "Оружия",
			location: "right-middle",
			items: [{
					text: "Ближний бой"
				},
				{
					text: "Пистолеты"
				},
				{
					text: "Пистолеты-пулеметы"
				},
				{
					text: "Ружья"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"biz_8_melee": {
			header: "Ближний бой",
			location: "right-middle",
			items: [{
					text: "Бейсбольная бита"
				},
				{
					text: "Кастет"
				},
				{
					text: "Нож"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"biz_8_handguns": {
			header: "Пистолеты",
			location: "right-middle",
			items: [{
					text: "Pistol"
				},
				{
					text: "AP Pistol"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"biz_8_submachine_guns": {
			header: "Пистолеты-пулеметы",
			location: "right-middle",
			items: [{
					text: "Micro SMG"
				},
				{
					text: "SMG"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"biz_8_shotguns": {
			header: "Ружья",
			location: "right-middle",
			items: [{
					text: "Sawed-Off Shotgun"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"biz_8_ammo": {
			header: "Патроны",
			location: "right-middle",
			items: [{
					text: "Патроны - 9mm",
					values: ["10 шт.", "20 шт.", "40 шт.", "80 шт."],
				},
				{
					text: "Патроны - 12mm",
					values: ["10 шт.", "20 шт.", "40 шт.", "80 шт."],
				},
				{
					text: "Патроны - 5.56mm",
					values: ["10 шт.", "20 шт.", "40 шт.", "80 шт."],
				},
				{
					text: "Патроны - 7.62mm",
					values: ["10 шт.", "20 шт.", "40 шт.", "80 шт."],
				},
				{
					text: "Вернуться"
				},
			]
		},

		"enter_biz_9": {
			header: "Автосалон",
			location: "right-middle",
			items: [{
					text: "Купить авто"
				},
			],
			on: (values) => {
				onEnterBizHandler("enter_biz_9", values);
			},
		},

		"sell_car": {
			header: "Черный рынок",
			location: "right-middle",
			logo: false,
			items: [{
					text: "Продать автомобиль"
				},
			]
		},
		"enter_biz_10": {
			header: "LS Customs",
			location: "right-middle",
			items: [{
					text: "Пункт 1"
				},
				{
					text: "Пункт 2"
				},
				{
					text: "Пункт 3"
				},
			],
			on: (values) => {
				onEnterBizHandler("enter_biz_10", values);
			},
		},
		"enter_biz_11": {
			header: "СТО",
			location: "right-middle",
			items: [{
					text: "Пункт 1"
				},
				{
					text: "Пункт 2"
				},
				{
					text: "Пункт 3"
				},
			],
			on: (values) => {
				onEnterBizHandler("enter_biz_11", values);
			},
		},
		"biz_panel": {
			header: "Панель управления",
			location: "right-middle",
			items: [{
					text: "Информация о бизнесе"
				},
				{
					text: "Касса"
				},
				{
					text: "Доходы и расходы"
				},
				{
					text: "Товар"
				},
				{
					text: "Персонал"
				},
				{
					text: "Улучшения для бизнеса"
				},
				{
					text: "Статус бизнеса"
				},
				{
					text: "Продать бизнес"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"biz_cashbox": {
			header: "Касса",
			location: "right-middle",
			items: [{
					text: "Баланс кассы"
				},
				{
					text: "Вывести с кассы"
				},
				{
					text: "Пополнить кассу"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"biz_stats": {
			header: "Доходы и расходы",
			location: "right-middle",
			items: [{
					text: "История кассы"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"biz_products": {
			header: "Товар бизнеса",
			location: "right-middle",
			items: [{
					text: "Закупить товар"
				},
				{
					text: "Списать товар"
				},
				{
					text: "Цена товара"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"biz_staff": {
			header: "Персонал бизнеса",
			location: "right-middle",
			items: [{
					text: "Слот №1"
				},
				{
					text: "Слот №2"
				},
				{
					text: "Слот №3"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"biz_rise": {
			header: "Улучшения бизнеса",
			location: "right-middle",
			items: [{
				text: "Вернуться"
			}, ]
		},
		"biz_status": {
			header: "Статус бизнеса",
			location: "right-middle",
			items: [{
					text: "Открыть бизнес"
				},
				{
					text: "Закрыть бизнес"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"biz_sell": {
			header: "Продажа бизнеса",
			location: "right-middle",
			items: [{
					text: "Гражданину"
				},
				{
					text: "Государству"
				},
				{
					text: "Вернуться"
				},
			]
		},

		"police_storage": {
			header: "Склад LSPD",
			location: "right-middle",
			items: [{
					text: "Служебное вооружение"
				},
				{
					text: "Гардероб"
				},
				{
					text: "Спец. предметы"
				},
				{
					text: "Патроны"
				},
				{
					text: "Закрыть"
				},
			]
		},
		"police_guns": {
			header: "Служебное вооружение LSPD",
			location: "right-middle",
			items: [{
					text: "Nightstick"
				},
				{
					text: "Flashlight"
				},
				{
					text: "Stun Gun"
				},
				{
					text: "Combat Pistol"
				},
				{
					text: "Pump Shotgun"
				},
				{
					text: "Carbine Rifle"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"police_clothes": {
			header: "Гардероб LSPD",
			location: "right-middle",
			items: [{
					text: "Форма офицера №1"
				},
				{
					text: "Форма SWAT"
				},
				{
					text: "Форма офицера №2"
				},
				{
					text: "Бронежилет"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"police_items": {
			header: "Спец. предметы LSPD",
			location: "right-middle",
			items: [{
					text: "Удостоверение PD"
				},
				{
					text: "Рация"
				},
				{
					text: "Наручники"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"police_ammo": {
			header: "Патроны LSPD",
			location: "right-middle",
			items: [{
					text: "Combat Pistol - 9mm",
					values: ["12 шт.", "24 шт.", "32 шт."],
				},
				{
					text: "Pump Shotgun - 12mm",
					values: ["8 шт.", "16 шт.", "24 шт."],
				},
				{
					text: "Carbine Rifle - 5.56mm",
					values: ["12 шт.", "24 шт.", "32 шт."],
				},
				{
					text: "Sniper Rifle - 7.62mm",
					values: ["10 шт.", "20 шт.", "30 шт."],
				},
				{
					text: "Вернуться"
				},
			]
		},
		"police_service": {
			header: "Услуги LSPD",
			location: "right-middle",
			items: [{
					text: "Восстановление вещей",
				},
				{
					text: "Оплата штрафа",
				},
				{
					text: "Закрыть",
				},
			],
			on: (values) => {
				if (!values) return delete menus["police_service_recovery"].items[2].values;
				for (var i = 0; i < values.length; i++)
					values[i] = `№${values[i]}`;
				menus["police_service_recovery"].items[2].values = values;
			}
		},
		"police_service_recovery": {
			header: "Восстановление вещей",
			location: "right-middle",
			items: [{
					text: "Документы",
				},
				{
					text: "Ключи от авто",
				},
				{
					text: "Ключи от дома",
				},
				{
					text: "Вернуться",
				},
			]
		},

		"police_storage_2": {
			header: "Склад LSSD",
			location: "right-middle",
			items: [{
					text: "Служебное вооружение"
				},
				{
					text: "Гардероб"
				},
				{
					text: "Спец. предметы"
				},
				{
					text: "Патроны"
				},
				{
					text: "Закрыть"
				},
			]
		},
		"police_guns_2": {
			header: "Служебное вооружение LSSD",
			location: "right-middle",
			items: [{
					text: "Nightstick"
				},
				{
					text: "Flashlight"
				},
				{
					text: "Stun Gun"
				},
				{
					text: "Combat Pistol"
				},
				{
					text: "Pump Shotgun"
				},
				{
					text: "Carbine Rifle"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"police_clothes_2": {
			header: "Гардероб LSSD",
			location: "right-middle",
			items: [{
					text: "Спец. форма №1"
				},
				{
					text: "Форма Кадета"
				},
				{
					text: "Форма Помощника Шерифа"
				},
				{
					text: "Форма Сержанта"
				},
				{
					text: "Форма Лейтенанта"
				},
				{
					text: "Форма Капитана"
				},
				{
					text: "Форма Шерифа"
				},
				{
					text: "Бронежилет"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"police_items_2": {
			header: "Спец. предметы LSSD",
			location: "right-middle",
			items: [{
					text: "Удостоверение LSSD"
				},
				{
					text: "Рация"
				},
				{
					text: "Наручники"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"police_ammo_2": {
			header: "Патроны LSSD",
			location: "right-middle",
			items: [{
					text: "Combat Pistol - 9mm",
					values: ["12 шт.", "24 шт.", "32 шт."],
				},
				{
					text: "Pump Shotgun - 12mm",
					values: ["8 шт.", "16 шт.", "24 шт."],
				},
				{
					text: "Carbine Rifle - 5.56mm",
					values: ["12 шт.", "24 шт.", "32 шт."],
				},
				{
					text: "Sniper Rifle - 7.62mm",
					values: ["10 шт.", "20 шт.", "30 шт."],
				},
				{
					text: "Вернуться"
				},
			]
		},
		"police_service_2": {
			header: "Услуги LSSD",
			location: "right-middle",
			items: [{
					text: "Восстановление вещей",
				},
				{
					text: "Оплата штрафа",
				},
				{
					text: "Закрыть",
				},
			],
			on: (values) => {
				if (!values) return delete menus["police_service_recovery_2"].items[2].values;
				for (var i = 0; i < values.length; i++)
					values[i] = `№${values[i]}`;
				menus["police_service_recovery_2"].items[2].values = values;
			}
		},
		"police_service_recovery_2": {
			header: "Восстановление вещей",
			location: "right-middle",
			items: [{
					text: "Документы",
				},
				{
					text: "Ключи от авто",
				},
				{
					text: "Ключи от дома",
				},
				{
					text: "Вернуться",
				},
			]
		},

		"gover_storage": {
			header: "Склад Правительства",
			location: "right-middle",
			items: [{
					text: "Служебное вооружение"
				},
				{
					text: "Гардероб"
				},
				{
					text: "Спец. предметы"
				},
				{
					text: "Патроны"
				},
				{
					text: "Закрыть"
				},
			]
		},
		"gover_guns": {
			header: "Служебное вооружение Правительства",
			location: "right-middle",
			items: [{
					text: "Combat Pistol"
				},
				{
					text: "Pump Shotgun"
				},
				{
					text: "Carbine Rifle"
				},
				{
					text: "Электрошокер"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"gover_clothes": {
			header: "Гардероб Правительства",
			location: "right-middle",
			items: [{
					text: "Комплект №1"
				},
				{
					text: "Комплект №2"
				},
				{
					text: "Бронежилет"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"gover_items": {
			header: "Спец. предметы Правительства",
			location: "right-middle",
			items: [{
					text: "Рация"
				},
				{
					text: "Наручники"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"gover_ammo": {
			header: "Патроны Правительства",
			location: "right-middle",
			items: [{
					text: "Combat Pistol - 9mm",
					values: ["12 шт.", "24 шт.", "32 шт."],
				},
				{
					text: "Pump Shotgun - 12mm",
					values: ["8 шт.", "16 шт.", "24 шт."],
				},
				{
					text: "Carbine Rifle - 5.56mm",
					values: ["12 шт.", "24 шт.", "32 шт."],
				},
				{
					text: "Sniper Rifle - 7.62mm",
					values: ["10 шт.", "20 шт.", "30 шт."],
				},
				{
					text: "Вернуться"
				},
			]
		},

		"army_storage": {
			header: "Склад Fort Zancudo",
			location: "right-middle",
			items: [{
					text: "Служебное вооружение"
				},
				{
					text: "Гардероб"
				},
				{
					text: "Спец. предметы"
				},
				{
					text: "Патроны"
				},
				{
					text: "Закрыть"
				},
			]
		},
		"army_guns": {
			header: "Служебное вооружение Fort Zancudo",
			location: "right-middle",
			items: [{
					text: "Combat Pistol"
				},
				{
					text: "Pump Shotgun"
				},
				{
					text: "Carbine Rifle"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"army_clothes": {
			header: "Гардероб Fort Zancudo",
			location: "right-middle",
			items: [{
					text: "Форма рекрута"
				},
				{
					text: "Тактический набор №1"
				},
				{
					text: "Отдел IB"
				},
				{
					text: "Отдел FZA"
				},
				{
					text: "Боевая форма TFB"
				},
				{
					text: "Отдел MLG"
				},
				{
					text: "Армейская форма №1"
				},
				{
					text: "Армейская форма №2"
				},
				{
					text: "Бронежилет"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"army_items": {
			header: "Спец. предметы Fort Zancudo",
			location: "right-middle",
			items: [{
					text: "Удостоверение Army"
				},
				{
					text: "Рация"
				},
				{
					text: "Наручники"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"army_ammo": {
			header: "Патроны Fort Zancudo",
			location: "right-middle",
			items: [{
					text: "Combat Pistol - 9mm",
					values: ["12 шт.", "24 шт.", "32 шт."],
				},
				{
					text: "Pump Shotgun - 12mm",
					values: ["8 шт.", "16 шт.", "24 шт."],
				},
				{
					text: "Carbine Rifle - 5.56mm",
					values: ["12 шт.", "24 шт.", "32 шт."],
				},
				{
					text: "Sniper Rifle - 7.62mm",
					values: ["10 шт.", "20 шт.", "30 шт."],
				},
				{
					text: "Вернуться"
				},
			]
		},

		"news_storage": {
			header: "Склад News",
			location: "right-middle",
			items: [{
					text: "Гардероб"
				},
				{
					text: "Спец. предметы"
				},
				{
					text: "Закрыть"
				},
			]
		},

		"news_storage_1": {
			header: "Гардероб News",
			location: "right-middle",
			items: [{
					text: "Бронежилет"
				},
				{
					text: "Вернуться"
				},
			]
		},

		"news_storage_2": {
			header: "Спец. предметы News",
			location: "right-middle",
			items: [{
					text: "Рация"
				},
				{
					text: "Вернуться"
				},
			]
		},

		"army_storage_2": {
			header: "Склад USN",
			location: "right-middle",
			items: [{
					text: "Служебное вооружение"
				},
				{
					text: "Гардероб"
				},
				{
					text: "Спец. предметы"
				},
				{
					text: "Патроны"
				},
				{
					text: "Закрыть"
				},
			]
		},
		"army_guns_2": {
			header: "Служебное вооружение USN",
			location: "right-middle",
			items: [{
					text: "Combat Pistol"
				},
				{
					text: "Pump Shotgun"
				},
				{
					text: "Carbine Rifle"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"army_clothes_2": {
			header: "Гардероб USN",
			location: "right-middle",
			items: [{
					text: "Отряд - GRS"
				},
				{
					text: "Отряд - TLS"
				},
				{
					text: "Отряд - FHS"
				},
				{
					text: "Армейская форма"
				},
				{
					text: "Спец. форма"
				},
				{
					text: "Бронежилет"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"army_items_2": {
			header: "Спец. предметы USN",
			location: "right-middle",
			items: [{
					text: "Удостоверение Army"
				},
				{
					text: "Рация"
				},
				{
					text: "Наручники"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"army_ammo_2": {
			header: "Патроны USN",
			location: "right-middle",
			items: [{
					text: "Combat Pistol - 9mm",
					values: ["12 шт.", "24 шт.", "32 шт."],
				},
				{
					text: "Pump Shotgun - 12mm",
					values: ["8 шт.", "16 шт.", "24 шт."],
				},
				{
					text: "Carbine Rifle - 5.56mm",
					values: ["12 шт.", "24 шт.", "32 шт."],
				},
				{
					text: "Sniper Rifle - 7.62mm",
					values: ["10 шт.", "20 шт.", "30 шт."],
				},
				{
					text: "Вернуться"
				},
			]
		},
		"info_smuggling": {
			header: "Нелегальный информатор",
			location: "right-middle",
			items: [{
					text: "Местоположение сырья"
				},
				{
					text: "Местоположение лаборатории"
				},
				{
					text: "Местоположение точки сбыта"
				}
			]
		},
		"fib_storage": {
			header: "Склад FIB",
			location: "right-middle",
			items: [{
					text: "Служебное вооружение"
				},
				{
					text: "Гардероб"
				},
				{
					text: "Спец. предметы"
				},
				{
					text: "Патроны"
				},
				{
					text: "Закрыть"
				},
			]
		},
		"fib_guns": {
			header: "Служебное вооружение FIB",
			location: "right-middle",
			items: [{
					text: "Nightstick"
				},
				{
					text: "Flashlight"
				},
				{
					text: "Stun Gun"
				},
				{
					text: "Combat Pistol"
				},
				{
					text: "Pump Shotgun"
				},
				{
					text: "Carbine Rifle"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"fib_clothes": {
			header: "Гардероб FIB",
			location: "right-middle",
			items: [{
					text: "Стажер"
				},
				{
					text: "Агент"
				},
				{
					text: "Тактический набор №1"
				},
				{
					text: "Тактический набор №2"
				},
				{
					text: "Форма снайпера"
				},
				{
					text: "Бронежилет"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"fib_items": {
			header: "Спец. предметы FIB",
			location: "right-middle",
			items: [{
					text: "Удостоверение FIB"
				},
				{
					text: "Рация"
				},
				{
					text: "Наручники"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"fib_ammo": {
			header: "Патроны FIB",
			location: "right-middle",
			items: [{
					text: "Combat Pistol - 9mm",
					values: ["12 шт.", "24 шт.", "32 шт."],
				},
				{
					text: "Pump Shotgun - 12mm",
					values: ["8 шт.", "16 шт.", "24 шт."],
				},
				{
					text: "Carbine Rifle - 5.56mm",
					values: ["12 шт.", "24 шт.", "32 шт."],
				},
				{
					text: "Sniper Rifle - 7.62mm",
					values: ["10 шт.", "20 шт.", "30 шт."],
				},
				{
					text: "Вернуться"
				},
			]
		},

		"gang_storage": {
			header: "Склад",
			location: "right-middle",
			items: [{
				  text: "Сейф"
				},
				{
					text: "Оружейный арсенал"
				},
				{
					text: "Боеприпасы"
				},
				{
					text: "Наркотики"
				},
				{
					text: "Управление"
				},
				{
					text: "Закрыть"
				}
			]
		},

		"gang_storage_1": {
			header: "Сейф",
			location: "right-middle",
			items: [{
					text: "Пополнить сейф"
				},
				{
					text: "Снять с сейфа"
				},
				{
					text: "Вернуться"
				}
			]
		},
		"gang_storage_2": {
			header: "Наркотики",
			location: "right-middle",
			items: [{
					text: "Положить наркотики"
				},
				{
					text: "Взять наркотики"
				},
				{
					text: "Вернуться"
				}]
		},
		"gang_storage_3": {
			header: "Количество наркотиков",
			location: "right-middle",
			items: [{
					text: "Марихуана"
				},
				{
					text: "МДМА"
				},
				{
					text: "Кокаин"
				},
				{
					text: "Метамфетамин"
				},
				{
					text: "Вернуться"
				}]
		},
		"gang_storage_4": {
			header: "Количество наркотиков",
			location: "right-middle",
			items: [{
					text: "Марихуана"
				},
				{
					text: "МДМА"
				},
				{
					text: "Кокаин"
				},
				{
					text: "Метамфетамин"
				},
				{
					text: "Вернуться"
				}]
		},
		"gang_storage_5": {
			header: "Боеприпасы",
			location: "right-middle",
			items: [{
					text: "Положить боеприпасы"
				},
				{
					text: "Взять боеприпасы"
				},
				{
					text: "Вернуться"
				}]
		},
		"gang_storage_6": {
			header: "Количество боеприпасов",
			location: "right-middle",
			items: [{
					text: "Патроны 9mm"
				},
				{
					text: "Патроны 12mm"
				},
				{
					text: "Патроны 7.62mm"
				},
				{
					text: "Патроны 5.56mm"
				},
				{
					text: "Вернуться"
				}]
		},
		"gang_storage_7": {
			header: "Количество боеприпасов",
			location: "right-middle",
			items: [{
					text: "Патроны 9mm"
				},
				{
					text: "Патроны 12mm"
				},
				{
					text: "Патроны 7.62mm"
				},
				{
					text: "Патроны 5.56mm"
				},
				{
					text: "Вернуться"
				}]
		},
		"gang_storage_8": {
			header: "Управление",
			location: "right-middle",
			items: [{
					text: "Открыть / Закрыть склад"
				},
				{
					text: "Установить ранговые ограничения"
				},
				{
					text: "Вернуться"
				}]
		},
		"gang_storage_9": {
			header: "Ранговые ограничения",
			location: "right-middle",
			items: [{
					text: "Доступ к оружию"
				},
				{
					text: "Доступ к деньгам"
				},
				{
					text: "Доступ к наркотикам"
				},
				{
					text: "Доступ к боеприпасам"
				},
				{
					text: "Доступ к управлению"
				},
				{
					text: "Вернуться"
				}]
		},

		"gang_storage_10": {
			header: "Оружие",
			location: "right-middle",
			items: [{
					text: "Положить оружие"
				},
				{
					text: "Взять оружие"
				},
				{
					text: "Вернуться"
				}]
		},
		"gang_storage_11": {
			header: "Оружие",
			location: "right-middle",
			items: [{
					text: "Холодное оружие"
				},
				{
					text: "Пистолеты"
				},
				{
					text: "Пистолеты-пулеметы"
				},
				{
					text: "Ружья"
				},
				{
					text: "Штурмовые винтовки"
				},
				{
					text: "Легкие пулеметы"
				},
				{
					text: "Снайперские винтовки"
				},
				{
					text: "Тяжелое оружие"
				},
				{
					text: "Метательное оружие"
				},
				/*{
					text: "Разное"
				},*/
				{
					text: "Вернуться"
				},
			]
		},
		"gang_storage_12": {
			header: "Оружие",
			location: "right-middle",
			items: [{
					text: "Холодное оружие"
				},
				{
					text: "Пистолеты"
				},
				{
					text: "Пистолеты-пулеметы"
				},
				{
					text: "Ружья"
				},
				{
					text: "Штурмовые винтовки"
				},
				{
					text: "Легкие пулеметы"
				},
				{
					text: "Снайперские винтовки"
				},
				{
					text: "Тяжелое оружие"
				},
				{
					text: "Метательное оружие"
				},
				/*{
					text: "Разное"
				},*/
				{
					text: "Вернуться"
				},
			]
		},
		"gang_storage_11_1": {
			header: "Холодное оружие",
			location: "right-middle",
			items: [
				{text: "Старинный кинжал"},
				{text: "Бита"},
				{text: "Разбитая бутылка"},
				{text: "Лом"},
				{text: "Фонарик"},
				{text: "Клюшка"},
				{text: "Молоток"},
				{text: "Топор"},
				{text: "Кастет"},
				{text: "Нож"},
				{text: "Мачете"},
				{text: "Складной нож"},
				{text: "Полицейская дубинка"},
				{text: "Гаечный ключ"},
				{text: "Боевой топор"},
				{text: "Кий"},
				{text: "Каменный топор"},
				{text: "Вернуться"},
			]
		},
		"gang_storage_12_1": {
			header: "Холодное оружие",
			location: "right-middle",
			items: [
				{text: "Старинный кинжал"},
				{text: "Бита"},
				{text: "Разбитая бутылка"},
				{text: "Лом"},
				{text: "Фонарик"},
				{text: "Клюшка"},
				{text: "Молоток"},
				{text: "Топор"},
				{text: "Кастет"},
				{text: "Нож"},
				{text: "Мачете"},
				{text: "Складной нож"},
				{text: "Полицейская дубинка"},
				{text: "Гаечный ключ"},
				{text: "Боевой топор"},
				{text: "Кий"},
				{text: "Каменный топор"},
				{text: "Вернуться"},
			]
		},
		"gang_storage_11_2": {
			header: "Пистолеты",
			location: "right-middle",
			items: [
				{text: "Pistol"},
				{text: "Pistol Mk II"},
				{text: "Combat Pistol"},
				{text: "AP Pistol"},
				{text: "Stun Gun"},
				{text: "Pistol 50"},
				{text: "SNS Pistol"},
				{text: "SNS Pistol Mk II"},
				{text: "Heavy Pistol"},
				{text: "Vintage Pistol"},
				{text: "Flare Gun"},
				{text: "Marksman Pistol"},
				{text: "Heavy Revolver"},
				{text: "Heavy Revolver Mk II"},
				{text: "Double Action Revolver"},
				{text: "Вернуться"},
			]
		},
		"gang_storage_12_2": {
			header: "Пистолеты",
			location: "right-middle",
			items: [
				{text: "Pistol"},
				{text: "Pistol Mk II"},
				{text: "Combat Pistol"},
				{text: "AP Pistol"},
				{text: "Stun Gun"},
				{text: "Pistol 50"},
				{text: "SNS Pistol"},
				{text: "SNS Pistol Mk II"},
				{text: "Heavy Pistol"},
				{text: "Vintage Pistol"},
				{text: "Flare Gun"},
				{text: "Marksman Pistol"},
				{text: "Heavy Revolver"},
				{text: "Heavy Revolver Mk II"},
				{text: "Double Action Revolver"},
				{text: "Вернуться"},
			]
		},
		"gang_storage_11_3": {
			header: "Пистолеты-пулеметы",
			location: "right-middle",
			items: [
				{text: "Micro SMG"},
				{text: "SMG"},
				{text: "SMG Mk II"},
				{text: "Assault SMG"},
				{text: "Combat PDW"},
				{text: "Machine Pistol"},
				{text: "Mini SMG"},
				{text: "Вернуться"},
			]
		},
		"gang_storage_12_3": {
			header: "Пистолеты-пулеметы",
			location: "right-middle",
			items: [
				{text: "Micro SMG"},
				{text: "SMG"},
				{text: "SMG Mk II"},
				{text: "Assault SMG"},
				{text: "Combat PDW"},
				{text: "Machine Pistol"},
				{text: "Mini SMG"},
				{text: "Вернуться"},
			]
		},
		"gang_storage_11_4": {
			header: "Ружья",
			location: "right-middle",
			items: [
				{text: "Pump Shotgun"},
				{text: "Pump Shotgun Mk II"},
				{text: "Sawed-Off Shotgun"},
				{text: "Assault Shotgun"},
				{text: "Bullpup Shotgun"},
				{text: "Musket"},
				{text: "Heavy Shotgun"},
				{text: "Double Barrel Shotgun"},
				{text: "Sweeper Shotgun"},
				{text: "Вернуться"},
			]
		},
		"gang_storage_12_4": {
			header: "Ружья",
			location: "right-middle",
			items: [
				{text: "Pump Shotgun"},
				{text: "Pump Shotgun Mk II"},
				{text: "Sawed-Off Shotgun"},
				{text: "Assault Shotgun"},
				{text: "Bullpup Shotgun"},
				{text: "Musket"},
				{text: "Heavy Shotgun"},
				{text: "Double Barrel Shotgun"},
				{text: "Sweeper Shotgun"},
				{text: "Вернуться"},
			]
		},
		"gang_storage_11_5": {
			header: "Штурмовые винтовки",
			location: "right-middle",
			items: [
				{text: "Assault Rifle"},
				{text: "Assault Rifle Mk II"},
				{text: "Carbine Rifle"},
				{text: "Carbine Rifle Mk II"},
				{text: "Advanced Rifle"},
				{text: "Special Carbine"},
				{text: "Special Carbine Mk II"},
				{text: "Bullpup Rifle"},
				{text: "Bullpup Rifle Mk II"},
				{text: "Compact Rifle"},
				{text: "Вернуться"},
			]
		},
		"gang_storage_12_5": {
			header: "Штурмовые винтовки",
			location: "right-middle",
			items: [
				{text: "Assault Rifle"},
				{text: "Assault Rifle Mk II"},
				{text: "Carbine Rifle"},
				{text: "Carbine Rifle Mk II"},
				{text: "Advanced Rifle"},
				{text: "Special Carbine"},
				{text: "Special Carbine Mk II"},
				{text: "Bullpup Rifle"},
				{text: "Bullpup Rifle Mk II"},
				{text: "Compact Rifle"},
				{text: "Вернуться"},
			]
		},
		"gang_storage_11_6": {
			header: "Легкие пулеметы",
			location: "right-middle",
			items: [
				{text: "MG"},
				{text: "Combat MG"},
				{text: "Combat MG Mk II"},
				{text: "Gusenberg Sweeper"},
				{text: "Вернуться"},
			]
		},
		"gang_storage_12_6": {
			header: "Легкие пулеметы",
			location: "right-middle",
			items: [
				{text: "MG"},
				{text: "Combat MG"},
				{text: "Combat MG Mk II"},
				{text: "Gusenberg Sweeper"},
				{text: "Вернуться"},
			]
		},
		"gang_storage_11_7": {
			header: "Снайперские винтовки",
			location: "right-middle",
			items: [
				{text: "Sniper Rifle"},
				{text: "Heavy Sniper"},
				{text: "Heavy Sniper Mk II"},
				{text: "Marksman Rifle"},
				{text: "Marksman Rifle Mk II"},
				{text: "Вернуться"},
			]
		},
		"gang_storage_12_7": {
			header: "Снайперские винтовки",
			location: "right-middle",
			items: [
				{text: "Sniper Rifle"},
				{text: "Heavy Sniper"},
				{text: "Heavy Sniper Mk II"},
				{text: "Marksman Rifle"},
				{text: "Marksman Rifle Mk II"},
				{text: "Вернуться"},
			]
		},
		"gang_storage_11_8": {
			header: "Тяжелое оружие",
			location: "right-middle",
			items: [
				{text: "RPG"},
				{text: "Grenade Launcher"},
				{text: "Minigun"},
				{text: "Firework Launcher"},
				{text: "Railgun"},
				{text: "Homing Launcher"},
				{text: "Compact Grenade"},
				{text: "Вернуться"},
			]
		},
		"gang_storage_12_8": {
			header: "Тяжелое оружие",
			location: "right-middle",
			items: [
				{text: "RPG"},
				{text: "Grenade Launcher"},
				{text: "Minigun"},
				{text: "Firework Launcher"},
				{text: "Railgun"},
				{text: "Homing Launcher"},
				{text: "Compact Grenade"},
				{text: "Вернуться"},
			]
		},
		"gang_storage_11_9": {
			header: "Метательное оружие",
			location: "right-middle",
			items: [
				{text: "Осколочная граната"},
				{text: "Газовая граната"},
				{text: "Коктейль молотова"},
				{text: "Дымовая граната"},
				{text: "Сигнальная граната"},
				{text: "Вернуться"},
			]
		},
		"gang_storage_12_9": {
			header: "Метательное оружие",
			location: "right-middle",
			items: [
				{text: "Осколочная граната"},
				{text: "Газовая граната"},
				{text: "Коктейль молотова"},
				{text: "Дымовая граната"},
				{text: "Сигнальная граната"},
				{text: "Вернуться"},
			]
		},
		"gang_storage_11_10": {
			header: "Разное",
			location: "right-middle",
			items: [
				{text: "Парашют"},
				{text: "Огнетушитель"},
				{text: "Вернуться"},
			]
		},
		"gang_storage_12_10": {
			header: "Разное",
			location: "right-middle",
			items: [
				{text: "Парашют"},
				{text: "Огнетушитель"},
				{text: "Вернуться"},
			]
		},

		"band_storage": {
			header: "Склад банды",
			location: "right-middle",
			items: [{
					text: "Спец. предметы"
				},
				{
					text: "Закрыть"
				},
			]
		},
		"band_dealer_menu": {
			header: "Дилер",
			location: "right-middle",
			items: [{
					text: "Оружия"
				},
				{
					text: "Патроны"
				},
				{
					text: "Наркотики"
				},
				{
					text: "Предметы"
				},
				{
					text: "Маски"
				},
				{
					text: "Закрыть"
				},
			]
		},
		"band_dealer_menu_items": {
			header: "Предметы",
			location: "right-middle",
			items: [{
					text: "Стяжки | $150"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"band_dealer_menu_masks": {
			header: "Маски",
			location: "right-middle",
			items: [{
					text: "Маска №1 | $3000"
				},
				{
					text: "Маска №2 | $3200"
				},
				{
					text: "Маска №3 | $3400"
				},
				{
					text: "Маска №4 | $3600"
				},
				{
					text: "Маска №5 | $3800"
				},
				{
					text: "Маска №6 | $4000"
				},
				{
					text: "Маска №7 | $4200"
				},
				{
					text: "Маска №8 | $4400"
				},
				{
					text: "Маска №9 | $4600"
				},
				{
					text: "Маска №10 | $4800"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"band_dealer_menu_guns": {
			header: "Оружия",
			location: "right-middle",
			items: [{
					text: "Холодное оружие"
				},
				{
					text: "Пистолеты"
				},
				{
					text: "Пистолеты-пулеметы"
				},
				{
					text: "Ружья"
				},
				{
					text: "Штурмовые винтовки"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"band_dealer_menu_melee": {
			header: "Холодное оружие",
			location: "right-middle",
			items: [{
					text: "Бейсбольная бита | $200"
				},
				{
					text: "Кастет | $75"
				},
				{
					text: "Нож | $200"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"band_dealer_menu_handguns": {
			header: "Пистолеты",
			location: "right-middle",
			items: [{
					text: "Pistol | $2810"
				},
				{
					text: "Pistol-50 | $7000"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"band_dealer_menu_submachine_guns": {
			header: "Пистолеты-пулеметы",
			location: "right-middle",
			items: [{
					text: "Micro SMG | $3820"
				},
				{
					text: "SMG | $4650"
				},
				{
					text: "Machine Pistol | $5700"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"band_dealer_menu_shotguns": {
			header: "Ружья",
			location: "right-middle",
			items: [{
					text: "Sawnoff Shotgun | $4000"
				},
				{
					text: "Pump Shotgun | $4550"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"band_dealer_menu_assault_rifles": {
			header: "Штурмовые винтовки",
			location: "right-middle",
			items: [{
					text: "Compact Rifle | $7500"
				},
				{
					text: "Assault Rifle | $8500"
				},
				{
					text: "Carbine Rifle | $9700"
				},
				{
					text: "Advanced Rifle | $12000"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"band_dealer_menu_ammo": {
			header: "Патроны",
			location: "right-middle",
			items: [{
					text: "Патроны - 9mm | $6",
					values: ["10 шт.", "20 шт.", "40 шт.", "80 шт."],
				},
				{
					text: "Патроны - 12mm | $7",
					values: ["10 шт.", "20 шт.", "40 шт.", "80 шт."],
				},
				{
					text: "Патроны - 5.56mm | $7",
					values: ["10 шт.", "20 шт.", "40 шт.", "80 шт."],
				},
				{
					text: "Патроны - 7.62mm | $6",
					values: ["10 шт.", "20 шт.", "40 шт.", "80 шт."],
				},
				{
					text: "Вернуться"
				},
			]
		},
		"band_dealer_menu_drugs": {
			header: "Наркотики",
			location: "right-middle",
			items: [{
					text: "Марихуана | $6",
					values: ["1 г.", "5 г.", "20 г.", "40 г."],
				},
				{
					text: "МДМА | $10",
					values: ["1 г.", "5 г.", "20 г.", "40 г."],
				},
				{
					text: "Кокаин | $8",
					values: ["1 г.", "5 г.", "20 г.", "40 г."],
				},
				{
					text: "Метамфетамин | $9",
					values: ["1 г.", "5 г.", "20 г.", "40 г."],
				},
				{
					text: "Вернуться"
				},
			]
		},
		"hospital_storage": {
			header: "Склад Hospital",
			location: "right-middle",
			items: [{
					text: "Служебные принадлежности"
				},
				{
					text: "Гардероб"
				},
				{
					text: "Закрыть"
				},
			]
		},
		"hospital_items": {
		    header: "Служебные принадлежности Hospital",
		    location: "right-middle",
		    items: [{
		            text: "Аптечка"
		        },
		        {
		            text: "Пластырь"
		        },
		        {
		            text: "Удостоверение Hospital"
		        },
		        {
		            text: "Рация"
		        },
		        {
		            text: "Вернуться"
		        },
		    ]
		},
		"hospital_clothes": {
		    header: "Гардероб Hospital",
		    location: "right-middle",
		    items: [{
		            text: "Форма парамедика №1"
		        },
		        {
		            text: "Форма парамедика №2"
		        },
		        {
		            text: "Вернуться"
		        },
		    ]
		},
		"rooberauto_menu": {
			header: "Симон",
			location: "right-middle",
			items: [{
					text: "Перегон"
				},
				{
					text: "Автоугон"
				},
				{
					text: "Закрыть"
				},
			]
		},
		"bank_menu": {
			header: "Банк",
			location: "right-middle",
			items: []
		},
		"rent_faggio": {
			header: "Аренда",
			location: "right-middle",
			items: []
		},
		"helper_main": {
			header: "Помощь",
			location: "right-middle",
			items: []
		},
		"helper_second": {
			header: "Помощь",
			location: "right-middle",
			items: []
		},
		"ls_customs_repair": {
			logo: false,
			header: "LS Customs",
			location: "left-top",
			items: [{
					text: "Ремонт"
				},
				{
					text: "Выход"
				}
			]
		},
		"ls_customs_main": {
			logo: false,
			header: "LS Customs",
			location: "left-top",
			items: []
		},
		"ls_customs_concreteMod": {
			logo: false,
			header: "",
			location: "left-top",
			items: []
		},
		"ls_customs_headlightsMenu": {
			logo: false,
			header: "Фары",
			location: "left-top",
			items: []
		},
		"ls_customs_headlights": {
			logo: false,
			header: "Фары",
			location: "left-top",
			items: [{
					text: "Стандартные фары"
				},
				{
					text: "Ксеноновые фары"
				}
			]
		},
		"ls_customs_neonMenu": {
			logo: false,
			header: "Неоновые наборы",
			location: "left-top",
			items: [{
					text: "Расположение неоновых трубок"
				},
				{
					text: "Цвет неона"
				}
			]
		},
		"ls_customs_neonPosition": {
			logo: false,
			header: "Расположение неоновых трубок",
			location: "left-top",
			items: [{
					text: "Нет"
				},
				{
					text: "Передний"
				},
				{
					text: "Назад"
				},
				{
					text: "По бокам"
				},
				{
					text: "Спереди и сзади"
				},
				{
					text: "Спереди и по бокам"
				},
				{
					text: "Сзади и по бокам"
				},
				{
					text: "Спереди, сзади и по бокам"
				}
			]
		},
		"ls_customs_neonColor": {
			logo: false,
			header: "Цвет неона",
			location: "left-top",
			items: [/* {
					text: "Белый"
				},
				{
					text: "Синий"
				},
				{
					text: '"Электрический голубой"'
				},
				{
					text: '"Мятно-зеленый"'
				},
				{
					text: "Лайм"
				},
				{
					text: "Желтый"
				},
				{
					text: '"Золотой дождь"'
				},
				{
					text: "Оранжевый"
				},
				{
					text: "Красный"
				},
				{
					text: '"Розовый пони"'
				},
				{
					text: "Ярко-розовый"
				},
				{
					text: "Фиолетовый"
				},
				{
					text: '"Черный свет"'
				} */
			]
		},
		"ls_customs_hornsMenu": {
			logo: false,
			header: "Клаксоны",
			location: "left-top",
			items: [{
					text: "Стаднарт"
				},
				{
					text: "Музыкальные"
				},
				{
					text: "С повтором"
				}
			]
		},
		"ls_customs_hornsConcrete": {
			logo: false,
			header: "Клаксоны",
			location: "left-top",
			items: []
		},
		"ls_customs_numberPlate": {
			logo: false,
			header: "Номерные знаки",
			location: "left-top",
			items: [{
					text: "Синий на белом 1"
				},
				{
					text: "Синий на белом 2"
				},
				{
					text: "Синий на белом 3"
				},
				{
					text: "Желтый на синем"
				},
				{
					text: "Желтый на черном"
				}
			]
		},
		"ls_customs_colorMenu": {
			logo: false,
			header: "Окраски",
			location: "left-top",
			items: [{
					text: "Основной цвет"
				},
				{
					text: "Дополнительный цвет"
				}
			]
		},
		"ls_customs_colorGroup": {
			logo: false,
			header: "Цветовые группы",
			location: "left-top",
			items: [{
					text: "Хромированный"
				},
				{
					text: "Классический"
				},
				{
					text: "Матовый"
				},
				{
					text: "Металлик"
				},
				{
					text: "Металл"
				}
			]
		},
		"ls_customs_colorConcrete": {
			logo: false,
			header: "Цветовые группы",
			location: "left-top",
			items: []
		},
		"ls_customs_wheelsMenu": {
			logo: false,
			header: "Колёса",
			location: "left-top",
			items: [
				{ text: "Колёса" },
				{ text: "Цвет колёс" },
				{ text: "Шины" },
			]
		},
		"ls_customs_wheels_motoMenu": {
			logo: false,
			header: "Колёса",
			location: "left-top",
			items: [
				{ text: "Переднее колесо" },
				{ text: "Заднее колесо" }
			]
		},
		"ls_customs_wheels_carMenu": {
			logo: false,
			header: "Типы колес",
			location: "left-top",
			items: [
				{ text: "Эксклюзивные" },
				{ text: "Лоурайдер" },
				{ text: "Маслкар" },
				{ text: "Вездеход" },
				{ text: "Спорт" },
				{ text: "Внедорожник" },
				{ text: "Тюнер" }
			]
		},
		"ls_customs_wheels_typeMenu": {
			logo: false,
			header: "Типы дисков",
			location: "left-top",
			items: [
				{ text: "Стандартные диски" },
				{ text: "Хромированные диски" }
			]
		},
		"ls_customs_wheels_colors": {
			logo: false,
			header: "Цвета колёс",
			location: "left-top",
			items: []
		},
		"ls_customs_wheels_concreteMenu": {
			logo: false,
			header: "Колёса",
			location: "left-top",
			items: []
		},
		"ls_customs_wheels_tiresMenu": {
			logo: false,
			header: "Шины",
			location: "left-top",
			items: [
				{ text: "Дизайн шин" },
				{ text: "Улучшение шин" },
				{ text: "Дым от покрышек" }
			]
		},
		"ls_customs_wheels_tiresDesign": {
			logo: false,
			header: "Дизайн шин",
			location: "left-top",
			items: [
				/* { text: "Обычные покрышки" },
				{ text: "Заказные покрышки" } */
			]
		},
		"ls_customs_wheels_tiresUpgrade": {
			logo: false,
			header: "Улучшение шин",
			location: "left-top",
			items: [
				/* { text: "Пулестойкие покрышки" } */
			]
		},
		"ls_customs_wheels_tiresSmokeColor": {
			logo: false,
			header: "Дым от покрышек",
			location: "left-top",
			items: []
		},
		"ls_customs_turbo": {
			logo: false,
			header: "Турбонаддувы",
			location: "left-top",
			items: [
				/* { text: "Нет" },
				{ text: "Турбо-тюнинг" } */
			]
		},
		"ls_customs_windows": {
			logo: false,
			header: "Тонировка",
			location: "left-top",
			items: [
				/* { text: "Нет" },
				{ text: "Слабое затемнение" },
				{ text: "Среднее затемнение" },
				{ text: "Лимузин" } */
			]
		},
		"enter_driving_school": {
			header: "Центр лицензирования",
			location: "right-middle",
			items: [{
					text: "Лицензии"
				},
				{
					text: "Закрыть"
				},
			]
		},
		"driving_school_licenses": {
			header: "Лицензии",
			location: "right-middle",
			items: [{
					text: "Водитель"
				},
				{
					text: "Водный транспорт"
				},
				{
					text: "Пилот"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"driving_school_car": {
			header: "Водитель",
			location: "right-middle",
			items: [{
					text: "Автомобиль | $500"
				},
				{
					text: "Мототехника | $700"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"driving_school_water": {
			header: "Водный транспорт",
			location: "right-middle",
			items: [{
					text: "Лодки | $1000"
				},
				{
					text: "Яхты | $5000"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"driving_school_fly": {
			header: "Пилот",
			location: "right-middle",
			items: [{
					text: "Вертолёты | $2000"
				},
				{
					text: "Самолёты | $3000"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"trucker_load": {
			header: "Загрузка прицепа",
			location: "right-middle",
			items: [{
					text: "Загрузить",
					values: [] // filling in on()
				},
				{
					text: "Закрыть"
				},
			],
			on: () => {
				menus["trucker_load"].items[0].values = [];
				for (var i = 0; i < 50; i++) menus["trucker_load"].items[0].values.push(`${i + 1} т.`);
			},
		},
		"barbershop_m_main": {
			logo: false,
			header: "КАТЕГОРИИ",
			location: "left-top",
			items: [
				{ text: "Причёски" },
				{ text: "Бороды" },
				{ text: "Брови" },
				{ text: "Грудь" },
				{ text: "Линзы" },
				{ text: "Раскраска лица" },
				{ text: "Макияж" },
				{ text: "Уйти" }
			]
		},
		"barbershop_f_main": {
			logo: false,
			header: "КАТЕГОРИИ",
			location: "left-top",
			items: [
				{ text: "Причёски" },
				{ text: "Брови" },
				{ text: "Линзы" },
				{ text: "Раскраска лица" },
				{ text: "Макияж" },
				{ text: "Уйти" }
			]
		},
		"barbershop_concrete": {
			logo: false,
			header: "",
			location: "left-top",
			items: []
		},
		"barbershop_makeupMenu_m": {
			logo: false,
			header: "Макияж",
			location: "left-top",
			items: [
				{ text: "Глаз" },
				{ text: "Помада" }
			]
		},
		"barbershop_makeupMenu_f": {
			logo: false,
			header: "Макияж",
			location: "left-top",
			items: [
				{ text: "Румяна" },
				{ text: "Глаз" },
				{ text: "Помада" }
			]
		},

		"enter_farm": {
			header: "Ферма",
			location: "right-middle",
			items: [
				{
					text: "Работа"
				},
				{
					text: "Информация"
				},
				{
					text: "Помощь"
				},
				{
					text: "Закрыть"
				},
			]
		},
		"enter_farm_job": {
			header: "Работа на ферме",
			location: "right-middle",
			items: [
				{
					text: "Рабочий"
				},
				{
					text: "Фермер"
				},
				{
					text: "Тракторист"
				},
				{
					text: "Пилот"
				},
				{
					text: "Уволиться"
				},
				{
					text: "Вернуться"
				},
			]
		},
		"farm_warehouse": {
			header: "Склад фермы",
			location: "right-middle",
			items: [
				{
					text: "Посев зерна",
				},
				{
					text: "Покупка урожая",
				},
				{
					text: "Продажа зерна",
				},
				{
					text: "Выгрузка урожая",
				},
				{
					text: "Закрыть"
				},
			]
		},
		"farm_warehouse_fill_field": {
			header: "Загрузка зерна",
			location: "right-middle",
			items: [
				{
					text: "Поле",
					values: ["Участок №1", "Участок №2", "Участок №3", "Участок №4"],
				},
				{
					text: "Зерно",
					values: ["Тыква", "Капуста", "Травка"],
				},
				{
					text: "Загрузить",
				},
				{
					text: "Вернуться"
				},
			]
		},
		"farm_warehouse_buy_crop": {
			header: "Покупка урожая",
			location: "right-middle",
			items: [
				{
					text: "Урожай",
					values: ["Тыква", "Капуста", "Травка"],
				},
				{
					text: "Количество",
					values: ["1 ед.", "2 ед.", "3 ед."],
				},
				{
					text: "Закупить",
				},
				{
					text: "Вернуться"
				},
			]
		},
		"farm_warehouse_sell_grain": {
			header: "Продажа зерна",
			location: "right-middle",
			items: [
				{
					text: "Количество",
					values: ["1 ед.", "2 ед.", "3 ед."],
				},
				{
					text: "Продать",
				},
				{
					text: "Вернуться"
				},
			]
		},
	};
	var itemSelectedHandlers = {
		"farm_warehouse_fill_field": (itemName, itemValue, itemIndex) => {
			var fieldIdValueIndex = menus["farm_warehouse_fill_field"].items[0].valueIndex;
			if (!fieldIdValueIndex) fieldIdValueIndex = 0;
			var fieldId = parseInt(menus["farm_warehouse_fill_field"].items[0].values[fieldIdValueIndex].split(" ")[1].substr(1));

			var grainTypeValueIndex = menus["farm_warehouse_fill_field"].items[1].valueIndex;
			if (!grainTypeValueIndex) grainTypeValueIndex = 0;

			alt.emit("events.emitServer", `farm.warehouse.takeGrain`, JSON.stringify([fieldId, grainTypeValueIndex + 1]));
			selectMenuAPI.hide();
		},
	};

	window.selectMenuAPI = {
		show: (menuName, selectedIndex = 0, values = null) => {
			// alert(`selectMenu.show ${menuName} ${selectedIndex} ${values}`);
			if (!selectedIndex) selectedIndex = 0;
			var menu = menus[menuName];
			if (!menu) return;

			menu.name = menuName;
			window.currentMenu = menu;
			if (values != null && values != 'null') menu.on(JSON.parse(values));
			else if (menu.on) menu.on();

			var maxItemsCount = MAX_ITEMS_COUNT;
			if (menu.maxItemsCount) maxItemsCount = menu.maxItemsCount;

			var itemsCount = Math.min(menu.items.length, maxItemsCount);
			$(".window .window-header .window-header__title").text(menu.header);
			$(".window .window-header .window-header__counter").text(`1/${menu.items.length}`);
			$(".window .window-main").empty();

			var start = (selectedIndex < maxItemsCount) ? 0 : (selectedIndex - maxItemsCount + 1);
			for (var i = start; i < start + itemsCount; i++) {
				selectMenuAPI.addLastMenuItemToDOM(i);
			}

			if (menu.items[selectedIndex].values) {
				var value = $('.window .window-main td').eq(1).html();
				$('.window .window-main td').eq(1).html(`<b>< </b>${value}<b> ></b>`);
			}
			$(`.window .window-main tr[data-index="${selectedIndex}"]`).addClass("selected");
			if (menu.items[selectedIndex].type == "text-field") {
				setTimeout(() => {
					$('.window .selected input').focus();
				}, 5);
			}

			if (menu.location == "right-middle" && !chatAPI.isLeft())
				menu.location = "left-middle";
			else if (menu.location == "left-middle" && chatAPI.isLeft())
				menu.location = "right-middle";

			switch (menu.location) {
				case 'left-top':
					$('.window').css('left', '1vh');
					$('.window').css('top', '1vh');
					$('.window').css('right', '');
					$('.window').css('bottom', '');
					break;
				case 'left-middle':
					$('.window').css('left', '10vh');
					$('.window').css('top', '25vh');
					$('.window').css('right', '');
					$('.window').css('bottom', '');
					break;
				case 'left-middle-upper':
					$('.window').css('left', '10vh');
					$('.window').css('top', '12.5vh');
					$('.window').css('right', '');
					$('.window').css('bottom', '');
					break;
				case 'right-top':
					$('.window').css('left', '');
					$('.window').css('top', '1vh');
					$('.window').css('right', '1vh');
					$('.window').css('bottom', '');
					break;
				case 'right-middle':
					$('.window').css('left', '');
					$('.window').css('top', '25vh');
					$('.window').css('right', '10vh');
					$('.window').css('bottom', '');
					break;
				case 'right-middle-upper':
					$('.window').css('left', '');
					$('.window').css('top', '12.5vh');
					$('.window').css('right', '10vh');
					$('.window').css('bottom', '');
					break;
				case 'top':
					$('.window').css('left', Math.max(0, (($(window).width() - $('.window').outerWidth()) / 2) + $(window).scrollLeft()) + 'px');
					$('.window').css('top', '10vh');
					$('.window').css('right', '');
					$('.window').css('bottom', '');
					break;
			}

			$(`.window .promptHelp`).hide();

			if (menu.prompt) {
				$(`.window .promptHelp .text`).text(menu.prompt);
				$(`.window .promptHelp`).slideDown("fast");
			}

			$(`.window .hand-navigation`).hide();
			if (menu.items.length > maxItemsCount) {
				$(`.window .hand-navigation`).slideDown("fast");
			}

			if (menuName != "character_parents") $(`.window .family-preview`).hide();

			$(".window").slideDown("fast");
			alt.emit(`setSelectMenuActive`, true);
		},
		hide: () => {
			window.currentMenu = null;
			$(".window").slideUp("fast");
			alt.emit(`setSelectMenuActive`, false);
		},
		addLastMenuItemToDOM: (i) => {
			if (!currentMenu) return;
			var menu = currentMenu;
			var menuName = currentMenu.name;
			var value = "";
			var defaultIndex = menu.items[i].valueIndex || 0;

			if (menu.items[i].type == "choice-color") {

				value = menu.items[i].values[defaultIndex];
				var el = $(`<tr class="window-main__element" data-index='${i}'>
					<td>${menu.items[i].text}</td>
					<td align="right" class="color-td"><div></div></td>
				</tr>`);
				el.children('.color-td').children('div').css('background', value);

				$(".window .window-main").append(el);
			} else if (menu.items[i].type == "text-field") {
				value = menu.items[i].value || "";
				var placeholder = menu.items[i].placeholder || "";
				$(".window .window-main").append(`<tr class="window-main__element" data-index='${i}'>
					<td>${menu.items[i].text}</td>
					<td align="right"><input type='text' placeholder='${placeholder}' value='${value}' /></td>
				</tr>`);
			} else {
				if (menu.items[i].values) value = menu.items[i].values[defaultIndex];

				$(".window .window-main").append(`<tr class="window-main__element" data-index='${i}'>
					<td>${menu.items[i].text}</td>
					<td align="right">${value}</td>
				</tr>`);
			}
		},
		addFirstMenuItemToDOM: (i) => {
			if (!currentMenu) return;
			var menu = currentMenu;
			var menuName = currentMenu.name;
			var value = "";
			var defaultIndex = menu.items[i].valueIndex || 0;

			if (menu.items[i].type == "choice-color") {


				value = menu.items[i].values[defaultIndex];
				var el = $(`<tr class="window-main__element" data-index='${i}'>
					<td>${menu.items[i].text}</td>
					<td align="right" class="color-td"><div></div></td>
				</tr>`);
				el.children('.color-td').children('div').css('background', value);

				$(".window .window-main").prepend(el);
			} else if (menu.items[i].type == "text-field") {
				value = menu.items[i].value;
				var placeholder = menu.items[i].placeholder || "";
				$(".window .window-main").prepend(`<tr class="window-main__element" data-index='${i}'>
					<td>${menu.items[i].text}</td>
					<td align="right"><input type='text' placeholder='${placeholder}' value='${value}' /></td>
				</tr>`);
			} else {
				if (menu.items[i].values) value = menu.items[i].values[defaultIndex];

				$(".window .window-main").prepend(`<tr  class="window-main__element" data-index='${i}'>
					<td>${menu.items[i].text}</td>
					<td align="right">${value}</td>
				</tr>`);
			}
		},
		active: () => {
			return $(".window").css("display") != "none";
		},
		init: () => {
			$(document).unbind('keydown', selectMenuAPI.handler);
			$(document).keydown(selectMenuAPI.handler);
		},
		clearState: (menuName) => {
			var items = menus[menuName].items;
			if (!items) return;
			for (var i = 0; i < items.length; i++) {
				items[i].valueIndex = 0;
			}
		},
		setItems: (menuName, itemsName) => {
			var menu = menus[menuName];
			var items = menuItems[itemsName];
			if (!menu || !items) return;

			menu.items = items;
		},
		setSpecialItems: (menuName, items) => {
			//debug(`selectMenuAPI.setSpecialItems: ${menuName} ${items}`)
			items = JSON.parse(items);
			var menu = menus[menuName];
			if (!menu || !items) return;
			menu.items = items;
		},
		setItemName: (menuName, index, newName) => {
			var menu = menus[menuName];
			if (!menu.items[index]) return;
			menu.items[index] = newName;
		},
		setHeader: (menuName, header) => {
			const menu = menus[menuName];

			if (!menu) {
				return;
			}

			menu.header = header;
		},
		setPrompt: (menuName, text) => {
			const menu = menus[menuName];

			if (!menu) {
				return;
			}

			menu.prompt = text;
		},
		setItemValueIndex: (menuName, itemIndex, index) => {
			const menu = menus[menuName];

			if (!menu) {
				return;
			}

			if (!menu.items[itemIndex]) {
				return;
			}

			menu.items[itemIndex].valueIndex = index;
		},
		handler: (e) => {
			if (!selectMenuAPI.active() || !currentMenu || window.telePhone.active()) return;
			if (e.keyCode == 38) { //up

				var items = currentMenu.items;
				var itemIndex = $(".window .selected").data("index");
				if (itemIndex < 1) return;

				if ($(".window .selected").is(":first-child")) {
					$(".window .window-main tr:last").remove();
					selectMenuAPI.addFirstMenuItemToDOM(itemIndex - 1);
				}

				if (items[itemIndex].type == "text-field") {
					items[itemIndex].value = $(".window .selected input").val();
					$(".window .selected input").blur();
				}

				$(".window .window-header .window-header__counter").text(`${itemIndex}/${items.length}`);
				if (items[itemIndex].values) $('.window .selected b').remove();

				$(".window .window-main .selected").removeClass("selected");
				$(`tr[data-index="${itemIndex-1}"]`).addClass("selected");

				var itemValue = null;
				if (items[itemIndex - 1].values) {
					var value = $('.window .selected td').eq(1).html();
					var valueIndex = items[itemIndex - 1].valueIndex || 0;
					itemValue = items[itemIndex - 1].values[valueIndex];
					$('.window .selected td').eq(1).html(`<b>< </b>${value}<b> ></b>`);
				}
				if (items[itemIndex - 1].type == "text-field") {
					setTimeout(() => {
						$(".window .selected input").focus();
					}, 5);
				}

				alt.emit(`selectMenu.itemFocusChanged`, currentMenu.name, items[itemIndex - 1].text, itemValue, itemIndex - 1, valueIndex);
			} else if (e.keyCode == 40) { //bottom
				var items = currentMenu.items;
				var itemIndex = $(".window .selected").data("index");
				if (itemIndex >= items.length - 1) return;

				if ($(".window .selected").is(":last-child")) {
					$(".window .window-main tr:first").remove();
					selectMenuAPI.addLastMenuItemToDOM(itemIndex + 1);
				}

				if (items[itemIndex].type == "text-field") {
					items[itemIndex].value = $(".window .selected input").val();
					$(".window .selected input").blur();
				}

				$(".window .window-header .window-header__counter").text(`${itemIndex+2}/${items.length}`);
				if (items[itemIndex].values) $('.window .selected b').remove();


				$(".window .window-main .selected").removeClass("selected");
				$(`tr[data-index="${itemIndex+1}"]`).addClass("selected");

				var itemValue = null;
				if (items[itemIndex + 1].values) {
					var value = $('.window .selected td').eq(1).html();
					var valueIndex = items[itemIndex + 1].valueIndex || 0;
					itemValue = items[itemIndex + 1].values[valueIndex];
					$('.window .selected td').eq(1).html(`<b>< </b>${value}<b> ></b>`);
				}
				if (items[itemIndex + 1].type == "text-field") {
					setTimeout(() => {
						$(".window .selected input").focus();
					}, 5);
				}

				alt.emit(`selectMenu.itemFocusChanged`, currentMenu.name, items[itemIndex + 1].text, itemValue, itemIndex + 1, valueIndex);
			} else if (e.keyCode == 37) { //left
				var items = currentMenu.items;
				var itemIndex = $(".window .selected").data("index");
				if (!items[itemIndex].values) return;

				var valueIndex = items[itemIndex].valueIndex || 0;
				if (valueIndex < 1) return;

				value = items[itemIndex].values[valueIndex - 1];
				items[itemIndex].valueIndex = valueIndex - 1;
				if (items[itemIndex].type != "choice-color")
					$(".window .selected td").eq(1).html(`<b>< </b>${value}<b> ></b>`);
				else {
					$(".window .selected .color-td").html(`<b>< </b><div></div><b> ></b>`);
					$(".window .selected div").css("background", value);
				}

				alt.emit(`selectMenu.itemValueChanged`, currentMenu.name, items[itemIndex].text, value, itemIndex, valueIndex - 1);
			} else if (e.keyCode == 39) { //right
				var items = currentMenu.items;
				var itemIndex = $(".window .selected").data("index");
				if (!items[itemIndex].values) return;

				var valueIndex = items[itemIndex].valueIndex || 0;
				if (valueIndex >= items[itemIndex].values.length - 1)
					return;

				value = items[itemIndex].values[valueIndex + 1];
				items[itemIndex].valueIndex = valueIndex + 1;
				if (items[itemIndex].type != "choice-color")
					$(".window .selected td").eq(1).html(`<b>< </b>${value}<b> ></b>`);
				else {
					$(".window .selected .color-td").html(`<b>< </b><div></div><b> ></b>`);
					$(".window .selected div").css("background", value);
				}

				alt.emit(`selectMenu.itemValueChanged`, currentMenu.name, items[itemIndex].text, value, itemIndex, valueIndex + 1);
			} else if (e.keyCode == 13) { //enter
				var items = currentMenu.items;
				var itemIndex = $(".window .selected").data("index");
				var itemValue = null;
				if (items[itemIndex].valueIndex == null && items[itemIndex].values) items[itemIndex].valueIndex = 0;
				var valueIndex = (items[itemIndex].valueIndex == null) ? -1 : items[itemIndex].valueIndex;
				if (valueIndex != -1 && items[itemIndex].values) itemValue = items[itemIndex].values[valueIndex];
				//console.log(`${currentMenu.name}, ${items[itemIndex].text}, ${itemValue}, ${itemIndex}`)
				if (itemSelectedHandlers[currentMenu.name]) return itemSelectedHandlers[currentMenu.name](items[itemIndex - 1].text, items[itemIndex].text, itemValue, itemIndex);
				alt.emit(`selectMenu.itemSelected`, currentMenu.name, items[itemIndex].text, itemValue, itemIndex);
			} else if (e.keyCode == 8) { //backspace
				var items = currentMenu.items;
				var itemIndex = $(".window .selected").data("index");
				var itemValue = null;
				var valueIndex = items[itemIndex].valueIndex || -1;
				if (valueIndex != -1) itemValue = items[itemIndex].values[valueIndex];

				alt.emit(`selectMenu.backspacePressed`, currentMenu.name, items[itemIndex].text, itemValue, itemIndex);
			}
		},
		getValue: (menuName, itemName) => {
			if (!menus[menuName]) return name;
			var items = menus[menuName].items;
			for (var i = 0; i < items.length; i++)
				if (items[i].text == itemName) return items[i].value;

			return null;
		},
	};

	selectMenuAPI.init();
	//selectMenuAPI.show("test");
});

alt.on(`selectMenuAPI.show`, (menuName, selectedIndex, values) => {
	//console.log(`${menuName}`)
	selectMenuAPI.show(menuName, selectedIndex, values);
});

alt.on(`selectMenuAPI.hide`, () => {
	selectMenuAPI.hide();
});

alt.on(`selectMenu.clearState`, (menuName) => {
	selectMenuAPI.clearState(menuName);
});

alt.on(`selectMenuAPI.setItems`, (menuName, itemsName) => {
	selectMenuAPI.setItems(menuName, itemsName);
});

alt.on(`selectMenuAPI.setSpecialItems`, (menuName, items) => {
	selectMenuAPI.setSpecialItems(menuName, items);
});

alt.on(`selectMenuAPI.setHeader`, (menuName, header) => {
	selectMenuAPI.setHeader(menuName, header);
});

alt.on(`selectMenu.setPrompt`, (menuName, text) => {
	selectMenuAPI.setPrompt(menuName, text);
});

alt.on(`selectMenu.setItemValueIndex`, (menuName, itemIndex, index) => {
	selectMenuAPI.setItemValueIndex(menuName, itemIndex, index);
});

alt.on(`selectMenu.setItemValueIndex`, (menuName, itemIndex, index) => {
	selectMenuAPI.setItemValueIndex(menuName, itemIndex, index);
});

alt.on(`selectMenu.setItemName`, (menuName, index, newName) => {
	selectMenuAPI.setItemName(menuName, index, newName);
});

function setMotherImage(index) {
	$(`.selectMenu .family-preview img:eq(0)`).attr("src", `img/customization/parent/female_${index}.png`);
}

function setFatherImage(index) {
	$(`.selectMenu .family-preview img:eq(1)`).attr("src", `img/customization/parent/male_${index}.png`);
}

alt.on(`selectMenu.setFatherImage`, (index) => {
	setFatherImage(index);
});

alt.on(`selectMenu.setMotherImage`, (index) => {
	setMotherImage(index);
});